{
  "offering": [
    {
      "title": "Tax Outsorcing",
      "shortDisc": "Our tax experts are proficient in preparation of US, UK, Ireland, Canada and Australia tax returns. Thus we provide you the platform for tax return preparation keeping...",
      "discription": [
        "Our tax team is expert and proficient in preparation and filing of UK & Irish, US & Canadian tax returns for individuals, corporate and trust. We work through the checklist provided by the accountancy practice and complete the tax returns accordingly. ",
        "The tax outsourcing department usually handles SA 100, SA 800, CT 600, Form 11’s, CT 1, US 1040 & 1120’s, T1 and T2 tax returns. Their main aim is to meet the deadlines during tax season and maintain quality standards set by the accountancy practice.",
        "‍So sit back and relax when you outsource your tax return to Axon"
      ],
      "point": {
        "isPoints": false,
        "pointTitle": "",
        "pointList": []
      }
    },
    {
      "title": "Accounting OUTSOURCING",
      "shortDisc": "Every business needs to have accurate picture of their financial position on day to day basis. So books of Accounts need to be regularly updated. Our experts have the ability for real time...",
      "discription": [
        "Every business needs to have accurate picture of their financial position on day-to-day basis. So books of Accounts need to be regularly updated.",
        "Our Accounting Team has the ability and capacity for real time processing of the accounting information in Xero, Kashflow, Quickbooks, Myob, using receipt bank, auto entry. Further there is specialised accounting team to process accounting information remotely using RDP technique in Sage, TAS, VT+, CCH, Quickbooks."
      ],
      "point": {
        "isPoints": true,
        "pointTitle": "The various outsourced function which Axon accounting team is involved in:",
        "pointList": [
          "Bookkeeping & VAT Returns.",
          "Accounts Receivable",
          "Year-End Accounts Preparation and Filing in excel working papers.",
          "Statutory Accounts based on FRS 102 & 105 (Full & Abbreviated in pdf).",
          "Monthly Management Accounts.",
          "Financial Reporting with hyper-linking.",
          "Audit & Compliances Services (PQA’s & SCAPS)."
        ]
      }
    },
    {
      "title": "CPA & CA",
      "shortDisc": "We provide complete back office services to CPA's & CA's in US, UK, Ireland, Canada and Australia which reduces cost and increase profits and productivity. We are offering free...",
      "discription": [
        "Having global experience of more than 15 years in outsourcing services, we are pioneers in outsourcing over the globe.",
        "We have a team of over 75 qualified accountants (including CA, CPA, MBA, ACCA, FCA) who work from our offshore production centre in India to deliver qualitative services to their clients under the umbrella of data protection and GDPR regulation.",
        "We provide complete back office F&A services to CPA’s & CA’s in UK & Ireland, US & Canada and Australia, which not only reduces their cost but increase the profitability and productivity."
      ],
      "point": {
        "isPoints": false,
        "pointTitle": "",
        "pointList": []
      }
    },
    {
      "title": "Payroll Outsourcing",
      "shortDisc": "Payroll processing is sensitive and very time consuming process for accountancy practice. So there is a need for full time involvement of a payroll expert. This will not only save time and money but increases productivity and efficiency. Why don’t you outsource payroll processing to Axon??????",
      "discription": [],
      "point": {
        "isPoints": true,
        "pointTitle": "",
        "pointList": [
          "New company payroll set up, pension set up & RTI implementation.",
          "Generating Payslips and sending to employees (fixed or variable, weekly or monthly).",
          "Provide gross to net summary of wages for employer & employee.",
          "Process and provide P45 & P60.",
          "Process statutory sick pay, statutory maternity pay, student loan deduction, tax credits, insurances, etc",
          "Playing with revenue website for payroll reconciliations using certs."
        ]
      }
    },
    {
      "title": "Full-Time Employees",
      "shortDisc": "We provide fulltime or part time Dedicated Accounting Professional (DAP) to accountancy practices for Accounting and Bookkeeping, Tax Preparation...",
      "discription": [
        "We provide fulltime or part time Dedicated Accounting Professional (DAP) to accountancy practices for Accounting and Bookkeeping, VAT Returns, Tax Return Preparation & Payroll Processing.",
        "In addition DAP Axon do have qualified accountants for processing Year End Accounts, Letters, PQA’s and SCAP’s.",
        "Don’t go for freelancing or low priced solutions."
      ],
      "point": {
        "isPoints": false,
        "pointTitle": "",
        "pointList": []
      }
    },
    {
      "title": "UK & EU",
      "shortDisc": "We provide wide range of UK & EU outsourcing services for accounting and bookkeeping, payroll processing, tax return prep and other back office outsourcing services...",
      "discription": [
        "Axon outsourcing provides wide range of UK & EU Outsourcing services for Taxes, Accounting & Bookkeeping, Payroll and other Finance Outsourcing."
      ],
      "point": {
        "isPoints": true,
        "pointTitle": "",
        "pointList": [
          "Bookkeeping and Accounting in Sage, QuickBooks, VT, Caseware and IRIS.",
          "VAT Return Preparation and online filing with HMRC.",
          "Year End Accounts & Self assessment preparation in Sage, IRIS, Viztopia, SAPAincluding CT 600 Preparation and filing it with HMRC.",
          "Filing year end accounts with Companies house using IRIS, Viztopia, Digita, Caseware & SAPA",
          "Tax return preparation in Taxcalc, PTP, Digita.",
          "Handling Invoicing for AR/AP with credit control and reconciliations.",
          "Accounting working Papers and Management Working Papers in Excel.",
          "Payroll preparation and online filing with HMRC like P11D,P14,P30,P32,P35,P45,P60 and emailing payslip to clients.",
          "All Registrations with HMRC for UTR, PAYE, VAT, CIS, SA's, CT's, etc. and initiating interactions on behalf of client.",
          "Payroll preparation and online filing with HMRC like P11D,P14,P30,P32,P35,P45,P60 and emailing payslip to clients.",
          "Handling all online Secretarial work of Companies House and interactions on behalf of client."
        ]
      }
    }
  ]
}
